<template>
    <div class="main">
        <h1 class="h1Class">С днём защитника отечества!</h1>
        <User v-for="user in users" :key="user.id" :id="user.id" :text="user.text" @remove="remove"
            @change="change" />
    </div>
</template>
<script>
import User from './components/icons/User.vue'
export default {
    components: {
        User
    },
    data() {
        return {
            users: [
                {
                    id: 1,
                    text: 'Мой самый первый защитник, мой заступник, моя опора, мой дорогой папа! Поздравляю с 23 Февраля и желаю быть сильным, успешным, удачливым, везучим, счастливым и, конечно же, здоровым. Люблю тебя и горжусь тобой!',
                },
                {
                    id: 2,
                    text: 'Поздравляю с 23 Февраля, дорогой папочка! Желаю тебе много радостных дней, здоровья, стойкости и мужества, гармонии и мира в душе, чтобы финансы прибывали и любовь семьи согревала тебя!',
                },
                {
                    id: 3,
                    text: 'Папа, с 23 Февраля! Желаю тебе невероятной силы и жизнелюбия, отличного самочувствия и силы духа. Будь всегда в отличной форме и получай удовольствие от жизни!',
                },
                {
                    id: 4,
                    text: 'Папочка! Желаю тебе здоровья размером со вселенную, счастья, которое уходит за самый горизонт, радости, которая может сравниться в объемах только с самым большим океаном. Всегда оставайся таким же добрым, веселым и сильным. Всегда будь для нас надежным плечом, верной опорой и самым любимым человеком. С 23 Февраля!',
                },
                {
                    id: 5,
                    text: 'С 23 Февраля, дорогой папа. Желаю тебе не падать духом, не стареть душой, не слабеть телом. Папа, пусть тебе всё будет по плечу. Пусть под твоей защитой будет семья и все важные цели. Желаю тебе удачи, поддержки родных, жизненных взлётов и многократных успехов в любом бою за мечту.',
                },
                {
                    id: 6,
                    text: 'С 23 Февраля, дорогой мой папа! Желаю быть крепким и сильным, смелым и гордым, умным и мужественным, терпеливым и решительным, настойчивым и неуязвимым, неутомимым и уверенным, изобретательным и ловким, весёлым и добрым. Папа, пусть во всех делах тебя ждёт только успех, пусть каждый день дарит тебе удачу, любовь близких, радость и благополучие.',
                },
                {
                    id: 7,
                    text: 'Дорогой папа, поздравляю тебя с 23 Февраля! Пусть не будет в твоей жизни нерешаемых проблем и напрасных тревог, пусть никогда не иссякнут твои силы, пусть всегда верным оказывается твой путь, пусть каждый день дарит успех в делах и праздник для души.',
                },
            ]
        }
    },
    methods: {
        change(id, text) {
            this.users = this.users.map((user) => {
                if (user.id === id) {
                    user.text = text
                }
                return user
            })
        },
        remove(id) {
            this.users = this.users.filter((user) => {
                return user.id !== id
            })
        }

    }
}
</script>
<style>
.main{
    background-color: black;
    opacity: 70%;
    width: 1000px;
    margin: auto;
    padding: 20px;
    padding-bottom: 70px;
}
.h1Class {
    color: rgb(233, 90, 73);
    font-size: 50px;
    font-weight: bold;
}

body {
    background-color: rgb(87, 86, 66);
    color: white;
    text-align: center;
}
</style>